{
    "position": "Biomedical Intern",
    "company": "LivaNova",
    "job_description": "The Competitive Intelligence and Data Analytics (CIDA) group within Corporate Development at LivaNova is seeking a competitive intelligence intern to support the company in better understanding and tracking the business landscape of LivaNova’s core markets of implantable neuromodulation and cardiovascular devices. Competitive intelligence and market insights members of CIDA have high impact and visibility across the organization, working on projects that impact commercial, marketing, clinical and/or R&D decision-making.\r\nAbout the Role:\r\n•\tThe internship will include one core project and additional smaller projects/activities over the course of the summer including:\r\n•\tQualitative and quantitative market research (e.g., healthcare provider interviews and surveys)\r\n•\tMarket and opportunity assessments\r\n•\tPartnering with commercial leadership to understand business needs and challenges\r\n•\tSynthesis of competitive updates and company financials/earnings reports\r\n•\tPipeline (new product) research and analysis\r\n•\tReading, synthesizing and socializing 3rd party reports and equity analyst reports\r\nTracking industry dynamics and market trends\r\n•\tAnalyzing clinical literature and clinical trial results\r\n•\tAnalyze various quantitative commercial and public data sets to inform business decisions (e.g., financial data, pharmacy and medical procedural data)\r\n•\tSupporting the development of financial models\r\n•\tCreating presentations showcasing insights and recommendations clearly and succinctly to senior leadership(workshops, MS office, ted talks, uber case study-pitchdeck)\r\nAbout You:\r\n•\tA strong candidate does not necessarily need to have all of the following, and we encourage you to apply if you can bring other skills and perspectives to the table\r\n•\tWorking toward or recently graduated from a Bachelor’s or Master’s program with a focus in the life sciences (e.g., biology, chemistry, physics, biomedical engineering) and/or business/economics\r\n•\tExperience applying various analytical and problem-solving approaches to real world problems and writing documentation and summary reports of your approaches and findings\r\n•\tPassion for data and strong analytical mindset\r\n•\tEnjoys working closely and collaborating with other team members (personal touch)\r\n•\tPractical understanding of how analysis can be synthesized into insights that enable key business decisions and processes\r\n•\tAn eagerness to learn from the industry perspective, dive deep into the business context, and a drive to understand the medical device markets in which LivaNova operates\r\n•\tCreative problem-solving skills and openness to learn new approaches and technologies\r\n•\tExcellent organizational and time management skills\r\n•\tProficiency/experience with the following software tools: Microsoft PowerPoint, Microsoft Excel. Tableau, PowerBI, or other business analytics software are nice to have\r\n•\tPrior experience in consulting, corporate strategy, finance, marketing, product management or general experience in the healthcare/medical device industry is nice to have",
    "profile": "behavioral",
    "questions": [
        " Tell me about a time you had to analyze a large dataset to identify key trends and insights. How did you approach this task, and what were the results? ",
        " Can you describe your experience conducting market research, particularly regarding interviews and surveys with healthcare providers?  What challenges did you face, and how did you overcome them? ",
        " Give an example of a time you had to synthesize complex information from multiple sources (e.g., reports, financial data, clinical literature) to inform a business decision. What was your process, and what was the outcome? ",
        " Describe a situation where you had to collaborate with a team to achieve a common goal. What was your role, and what contribution did you make to the team’s success? ",
        "  This role requires creating presentations for senior leadership.  Describe a presentation you developed, highlighting the challenges you faced in creating a clear and concise message for a non-technical audience.  What was the outcome?\n"
    ]
}